Revit 2027 API
AlignmentStationLabelOptions Constructor
 Creates an object with default values.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AlignmentStationLabelOptions(
	double station
)
Public Sub New (
	station As Double
)
public:
AlignmentStationLabelOptions(
	double station
)
new :
        station : float -> AlignmentStationLabelOptions
Parameters
station Double
The station at which the label will be placed.
See Also
Reference
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace